app/Controllers/Locais.php

DELETE FROM `locais`
WHERE `id_local` IN ('19')
---
    public function deletar()
    {
        $redirect = $this->verifica_sessao();

        if ($redirect) {
            return $redirect;
        }

        $model = new Locais_model();

        if(isset($_POST) && $_POST != null){
            foreach ($_POST as $key => $value) {
                $dadosAtualizar[$key] = $value;
            }
        }

        if(isset($dadosAtualizar['id_local']) && $dadosAtualizar['id_local'] != null){
            $id = $dadosAtualizar['id_local'];
        }else{
            return redirect()->to('/locais/listar_locais')->with('error', 'ID não informado.');
        }

        $model->delete($id);