app/Models/Agendamentos_model.php

    public function buscarAgendamentosPrincipal($id)
    {
        return $this->select('*')
        ->join('usuario', 'usuario.id_usuario = agendamento.id_usuario')
        ->join('locais', 'locais.id_local = agendamento.id_local')
        ->where('agendamento.id_usuario', $id)
        ->limit(4)
        ->find();
---
SELECT *
FROM `agendamento`
JOIN `usuario` ON `usuario`.`id_usuario` = `agendamento`.`id_usuario`
JOIN `locais` ON `locais`.`id_local` = `agendamento`.`id_local`
WHERE `agendamento`.`id_usuario` = '4'
 LIMIT 4

    public function buscarAgendamentos($id)
    {
        return $this->select('*')
        ->join('usuario', 'usuario.id_usuario = agendamento.id_usuario')
        ->join('locais', 'locais.id_local = agendamento.id_local')
        ->where('agendamento.id_usuario', $id)
        ->find();
---
SELECT *
FROM `agendamento`
JOIN `usuario` ON `usuario`.`id_usuario` = `agendamento`.`id_usuario`
JOIN `locais` ON `locais`.`id_local` = `agendamento`.`id_local`
WHERE `agendamento`.`id_usuario` = '7'

    public function buscarAgendamentos_admin($filtros = [])
    {
        $query = $this->select('*')
        ->join('usuario', 'usuario.id_usuario = agendamento.id_usuario')
        ->join('locais', 'locais.id_local = agendamento.id_local');

        if (!empty($filtros['id_usuario'])) {
            $query->where('agendamento.id_usuario', $filtros['id_usuario']);
        }
        if (!empty($filtros['status_agendamento'])) {
            $query->where('agendamento.status_agendamento', $filtros['status_agendamento']);
        }
        if (!empty($filtros['id_local'])) {
            $query->where('agendamento.id_local', $filtros['id_local']);
        }

        return $query->findAll();
---
SELECT *
FROM `agendamento`
JOIN `usuario` ON `usuario`.`id_usuario` = `agendamento`.`id_usuario`
JOIN `locais` ON `locais`.`id_local` = `agendamento`.`id_local`
WHERE `agendamento`.`id_usuario` = '7'
AND `agendamento`.`status_agendamento` = '5'
AND `agendamento`.`id_local` = '14'