app/Models/Endereco_model.php

    public function buscarEndereco($id)
    {
        return $this->where('id_usuario', $id)->first();
---
SELECT *
FROM `endereco`
WHERE `id_usuario` = '4'
 LIMIT 1