app/Models/Locais_model.php

SELECT *
FROM `locais`
WHERE `locais`.`uf_local` = 'SP'
---
    public function buscarLocais($uf)
    {
        return $this->select('*')
        ->where('locais.uf_local', $uf)
        ->find();

SELECT *
FROM `locais`
---
    public function buscarLocaisTodos()
    {
        return $this->findAll();