app/Models/Relatorios_model.php

    public function buscarAgendamentosRelatorioMensal()
    {
        $dataInicio = (new \DateTime())->modify('-4 months')->format('Y-m-01');
        $dataFim = (new \DateTime())->modify('last day of this month')->format('Y-m-t');

        return $this->where('data_agendamento >=', $dataInicio)
        ->where('data_agendamento <=', $dataFim)
        ->findAll();
---
SELECT *
FROM `agendamento`
WHERE `data_agendamento` >= '2024-11-01'
AND `data_agendamento` <= '2025-03-31'

    public function buscarAgendamentosRelatorioTotal()
    {
        $dataInicio = (new \DateTime())->modify('-4 months')->format('Y-m-01');
        $dataFim = (new \DateTime())->modify('last day of this month')->format('Y-m-t');

        return $this->where('data_agendamento >=', $dataInicio)
        ->where('data_agendamento <=', $dataFim)
        ->join('usuario', 'usuario.id_usuario = agendamento.id_usuario')
        ->findAll();
---
SELECT *
FROM `agendamento`
JOIN `usuario` ON `usuario`.`id_usuario` = `agendamento`.`id_usuario`
WHERE `data_agendamento` >= '2024-11-01'
AND `data_agendamento` <= '2025-03-31'