app/Models/Usuario_model.php

    public function getUser($username)
    {
        return $this->where('email_usuario', $username)->first();
---
SELECT *
FROM `usuario`
WHERE `email_usuario` = 'gustavo@gmail.com'
 LIMIT 1

    public function buscarTodosUser()
    {
        return $this->findAll();
---
SELECT *
FROM `usuario`